Autodesk.Revit.DB.WorksharingDisplaySettings.SetGraphicOverrides(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksharingDisplayGraphicSettings)
Sets the graphic overrides assigned to elements in a particular user workset.
worksetId:
The workset of interest, which must be a user workset.
overrides:
The desired graphic overrides for this workset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
worksetId does not correspond to a user workset in the document
containing this WorksharingDisplaySettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.SetGraphicOverrides(Autodesk.Revit.DB.CheckoutStatus,Autodesk.Revit.DB.WorksharingDisplayGraphicSettings)
Sets the graphic overrides assigned to elements with a particular ownership status.
status:
The ownership status of interest.
overrides:
The desired graphic overrides for this ownership status.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.SetGraphicOverrides(Autodesk.Revit.DB.ModelUpdatesStatus,Autodesk.Revit.DB.WorksharingDisplayGraphicSettings)
Sets the graphic overrides assigned to elements with a particular status in the central model.
status:
The status in the central model.
overrides:
The desired graphic overrides for this status.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.SetGraphicOverrides(System.String,Autodesk.Revit.DB.WorksharingDisplayGraphicSettings)
Sets the graphic overrides assigned to elements owned by a particular user.
The username cannot be on the list of removed usernames.
Remarks:
Note that you can specify usernames which do not yet exist in the document's user table.
username:
The username of the desired user.
overrides:
The desired graphic overrides for this user.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The username is on the list of removed users.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.GetGraphicOverrides(Autodesk.Revit.DB.WorksetId)
Returns the graphic overrides assigned to elements in a particular workset.
worksetId:
The workset id of interest.  This must be a user workset.
Returns:
Returns the graphic overrides assigned to the workset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
worksetId does not correspond to a user workset in the document
containing this WorksharingDisplaySettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.GetGraphicOverrides(System.String)
Returns the graphic overrides assigned for elements owned by a particular user.
username:
The username of a particular user.
Returns:
The graphic overrides assigned to this user.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This WorksharingDisplaySettings does not contain graphic overrides for the specified value of username.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.RestoreUsers(System.Collections.Generic.ICollection{System.String})
Adds users back to the list of displayed users and permits customization of the graphics.
Any usernames that are not currently removed will be ignored.
Returns the number of users who were actually restored.
Remarks:
This is the opposite of removing users.
Note that the user will be shown with default graphic overrides - any customizations that
existed prior to removing the user will not be restored.
usersToRestore:
The usernames of the users to restore.  Any usernames that are not currently removed will
be ignored.
Returns:
The number of usernames that were actually restored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.CanUserHaveOverrides(System.String)
Checks whether a single username can have customized graphic overrides.
Remarks:
Only users that have not been removed can have overrides.
Once it is removed, a username must be restored before its associated graphic overrides
can be customized.
username:
The username to check.
Returns:
False if the username is on the list of removed users, True otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.RemoveUsers(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{System.String},System.Collections.Generic.ICollection{System.String}@)
Removes users from the list of displayed users and permanently discards any customization of the graphics.
Note that a user cannot be removed if he or she owns any elements.
Remarks:
Note that default graphic overrides will be applied to any elements owned by these
users if they take ownership of any elements or worksets while they are removed.
Note also that the list of removed users will be shared by all users of the central model and
will remove all customizations by all users.
document:
The document containing this.
usersToRemove:
The usernames of the users to remove.
usersActuallyRemoved:
The users that were successfully removed.  Note that you cannot remove
users who currently own any elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.UserHasGraphicOverrides(System.String)
Checks whether there are graphic overrides that would apply to elements
owned by the given user in the "Individual Owners" display mode.
Remarks:
There will always be graphic overrides for all users included in the user
table.  In addition, there may be other users who have been explicitly assigned overrides.
username:
The username to check
Returns:
True if there are graphic overrides assigned to the username, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.GetOrCreateWorksharingDisplaySettings(Autodesk.Revit.DB.Document)
Returns the worksharing display settings for the document, creating
new settings for the current user if necessary.
Remarks:
Note that these settings are available even in models that are not
workshared.  This is to allow pre-configuring the display settings
before enabling worksets so that they can be stored in template files.
doc:
The document of interest.
Returns:
The worksharing display settings for the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
doc is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012